[[0, ["generate_uniform_random_number", true, "shape"]], [1, ["generate_uniform_random_number", true, "random_seed"]], [2, ["generate_uniform_random_number", true, "left_limit"]], [3, ["generate_uniform_random_number", true, "right_limit"]], [4, ["generate_uniform_random_number", false, "random_number"]], [5, ["parse_boolean", true, "input"]], [6, ["parse_boolean", false, "output"]], [7, ["parse_text", true, "input"]], [8, ["parse_text", false, "output"]], [9, ["parse_integer", true, "input"]], [10, ["parse_integer", false, "output"]], [11, ["parse_decimal", true, "input"]], [12, ["parse_decimal", false, "output"]], [13, ["lower_upper_case_text", true, "text"]], [14, ["lower_upper_case_text", true, "is_lower_case"]], [15, ["lower_upper_case_text", false, "processed_text"]], [16, ["join_text", true, "text"]], [17, ["join_text", true, "text_separator"]], [18, ["join_text", true, "dimension_index"]], [19, ["join_text", true, "keep_dimension"]], [20, ["join_text", false, "output"]], [21, ["index_text_to_one_hot", true, "text"]], [22, ["index_text_to_one_hot", true, "vocabulary"]], [23, ["index_text_to_one_hot", false, "one_hot_index"]], [24, ["slice_text", true, "text"]], [25, ["slice_text", true, "start_index"]], [26, ["slice_text", true, "end_index"]], [27, ["slice_text", false, "sliced_text"]], [28, ["insert_text", true, "text"]], [29, ["insert_text", true, "search_regex"]], [30, ["insert_text", true, "inserted_text"]], [31, ["insert_text", false, "processed_text"]], [32, ["split_text", true, "text"]], [33, ["split_text", true, "regex"]], [34, ["split_text", true, "pad_tag"]], [35, ["split_text", false, "split_text"]], [36, ["get_text_length", true, "input"]], [37, ["get_text_length", false, "output"]], [38, ["contain_text", true, "text"]], [39, ["contain_text", true, "search_regex"]], [40, ["contain_text", false, "is_contain"]], [41, ["split_subwords_longest_match_first", true, "words"]], [42, ["split_subwords_longest_match_first", true, "vocabulary"]], [43, ["split_subwords_longest_match_first", true, "skip_vocabulary"]], [44, ["split_subwords_longest_match_first", true, "subword_prefix"]], [45, ["split_subwords_longest_match_first", true, "unknown_tag"]], [46, ["split_subwords_longest_match_first", true, "pad_tag"]], [47, ["split_subwords_longest_match_first", false, "subwords"]], [48, ["index_text", true, "text"]], [49, ["index_text", true, "vocabulary"]], [50, ["index_text", false, "index"]], [51, ["replace_text", true, "text"]], [52, ["replace_text", true, "search_regex"]], [53, ["replace_text", true, "replace_with"]], [54, ["replace_text", false, "processed_text"]], [55, ["index_text_to_condensed_one_hot", true, "text"]], [56, ["index_text_to_condensed_one_hot", true, "vocabulary"]], [57, ["index_text_to_condensed_one_hot", false, "condensed_one_hot_index"]], [58, ["concatenate_text", true, "text_1"]], [59, ["concatenate_text", true, "text_2"]], [60, ["concatenate_text", false, "concatenated_text"]], [61, ["dropout", true, "array"]], [62, ["dropout", true, "probability"]], [63, ["dropout", false, "output"]], [64, ["argument_minimum", true, "array"]], [65, ["argument_minimum", true, "dimension_index"]], [66, ["argument_minimum", true, "keep_dimension"]], [67, ["argument_minimum", false, "argument"]], [68, ["divide", true, "left_operand"]], [69, ["divide", true, "right_operand"]], [70, ["divide", false, "divided_result"]], [71, ["error_function", true, "input"]], [72, ["error_function", false, "output"]], [73, ["argument_maximum", true, "array"]], [74, ["argument_maximum", true, "dimension_index"]], [75, ["argument_maximum", true, "keep_dimension"]], [76, ["argument_maximum", false, "argument"]], [77, ["subtract", true, "left_operand"]], [78, ["subtract", true, "right_operand"]], [79, ["subtract", false, "subtracted_result"]], [80, ["element_wise_multiply", true, "left_array"]], [81, ["element_wise_multiply", true, "right_array"]], [82, ["element_wise_multiply", false, "multiplied_array"]], [83, ["top_k", true, "array"]], [84, ["top_k", true, "dimension_index"]], [85, ["top_k", true, "k"]], [86, ["top_k", false, "top_k_array"]], [87, ["top_k", false, "top_k_indices"]], [88, ["minimum", true, "array"]], [89, ["minimum", true, "dimension_index"]], [90, ["minimum", true, "keep_dimension"]], [91, ["minimum", false, "minimum_result"]], [92, ["absolute_value", true, "target"]], [93, ["absolute_value", false, "result"]], [94, ["sum", true, "array"]], [95, ["sum", true, "dimension_index"]], [96, ["sum", true, "keep_dimension"]], [97, ["sum", false, "sum_result"]], [98, ["add", true, "left_operand"]], [99, ["add", true, "right_operand"]], [100, ["add", false, "added_result"]], [101, ["argument_multinomial", true, "probabilities"]], [102, ["argument_multinomial", true, "dimension_index"]], [103, ["argument_multinomial", true, "number_samples"]], [104, ["argument_multinomial", true, "random_seed"]], [105, ["argument_multinomial", false, "argument"]], [106, ["count_occurrences", true, "target"]], [107, ["count_occurrences", true, "count_against"]], [108, ["count_occurrences", false, "occurrences"]], [109, ["maximum", true, "array"]], [110, ["maximum", true, "dimension_index"]], [111, ["maximum", true, "keep_dimension"]], [112, ["maximum", false, "maximum_result"]], [113, ["multiply", true, "left_operand"]], [114, ["multiply", true, "right_operand"]], [115, ["multiply", false, "multiplied_result"]], [116, ["element_wise_exponentiate", true, "base"]], [117, ["element_wise_exponentiate", true, "exponent"]], [118, ["element_wise_exponentiate", false, "exponentiation"]], [119, ["element_wise_logarithm", true, "base"]], [120, ["element_wise_logarithm", true, "argument"]], [121, ["element_wise_logarithm", false, "exponent"]], [122, ["mean", true, "array"]], [123, ["mean", true, "dimension_index"]], [124, ["mean", true, "keep_dimension"]], [125, ["mean", false, "mean_result"]], [126, ["modulo", true, "left_operand"]], [127, ["modulo", true, "right_operand"]], [128, ["modulo", false, "result"]], [129, ["logical_and", true, "condition_1"]], [130, ["logical_and", true, "condition_2"]], [131, ["logical_and", false, "new_condition"]], [132, ["logical_or", true, "condition_1"]], [133, ["logical_or", true, "condition_2"]], [134, ["logical_or", false, "new_condition"]], [135, ["equal", true, "left_operand"]], [136, ["equal", true, "right_operand"]], [137, ["equal", false, "is_equal"]], [138, ["greater_than", true, "left_operand"]], [139, ["greater_than", true, "right_operand"]], [140, ["greater_than", false, "is_greater_than"]], [141, ["logical_not", true, "condition"]], [142, ["logical_not", false, "new_condition"]], [143, ["less_than", true, "left_operand"]], [144, ["less_than", true, "right_operand"]], [145, ["less_than", false, "is_less_than"]], [146, ["conditional_filter", true, "condition"]], [147, ["conditional_filter", true, "data_if_true"]], [148, ["conditional_filter", true, "data_if_false"]], [149, ["conditional_filter", false, "output_data"]], [150, ["contain", true, "target"]], [151, ["contain", true, "check_against"]], [152, ["contain", false, "is_contain"]], [153, ["identity", true, "input"]], [154, ["identity", false, "output"]], [155, ["exist_in_files", true, "dir_path"]], [156, ["exist_in_files", true, "file_name"]], [157, ["exist_in_files", false, "is_exist"]], [158, ["write_to_file", true, "dir_path"]], [159, ["write_to_file", true, "file_name"]], [160, ["write_to_file", true, "is_overwrite"]], [161, ["write_to_file", true, "data"]], [162, ["delete_folder", true, "dir_path"]], [163, ["read_sub_arrays_from_file", true, "dir_path"]], [164, ["read_sub_arrays_from_file", true, "file_name"]], [165, ["read_sub_arrays_from_file", true, "selected_indices"]], [166, ["read_sub_arrays_from_file", true, "dimension_index"]], [167, ["read_sub_arrays_from_file", false, "output"]], [168, ["read_from_file", true, "dir_path"]], [169, ["read_from_file", true, "file_name"]], [170, ["read_from_file", true, "extraction_schema"]], [171, ["read_from_file", false, "output"]], [172, ["sample_by_step", true, "array"]], [173, ["sample_by_step", true, "dimension_index"]], [174, ["sample_by_step", true, "step_value"]], [175, ["sample_by_step", false, "sampled_array"]], [176, ["reverse_order", true, "array"]], [177, ["reverse_order", true, "dimension_index"]], [178, ["reverse_order", false, "reversed_array"]], [179, ["filter", true, "array"]], [180, ["filter", true, "dimension_index"]], [181, ["filter", true, "condition"]], [182, ["filter", false, "filtered_array"]], [183, ["swap_dimensions", true, "array"]], [184, ["swap_dimensions", true, "dimension_index_1"]], [185, ["swap_dimensions", true, "dimension_index_2"]], [186, ["swap_dimensions", false, "swapped_array"]], [187, ["reshape", true, "input"]], [188, ["reshape", true, "new_shape"]], [189, ["reshape", false, "output"]], [190, ["get_dimension_size", true, "array"]], [191, ["get_dimension_size", true, "dimension_index"]], [192, ["get_dimension_size", false, "dimension_size"]], [193, ["range", true, "start_value"]], [194, ["range", true, "end_value"]], [195, ["range", true, "step_value"]], [196, ["range", false, "vector"]], [197, ["deduplicate_to_vector", true, "array"]], [198, ["deduplicate_to_vector", false, "deduped_vector"]], [199, ["get_sub_arrays", true, "input"]], [200, ["get_sub_arrays", true, "dimension_index"]], [201, ["get_sub_arrays", true, "selected_indices"]], [202, ["get_sub_arrays", false, "output"]], [203, ["slice", true, "array"]], [204, ["slice", true, "dimension_index"]], [205, ["slice", true, "start_index"]], [206, ["slice", true, "end_index"]], [207, ["slice", false, "sliced_array"]], [208, ["concatenate", true, "array_1"]], [209, ["concatenate", true, "array_2"]], [210, ["concatenate", true, "dimension_index"]], [211, ["concatenate", false, "concatenated_array"]], [212, ["get_shape", true, "input"]], [213, ["get_shape", false, "shape"]], [214, ["swap_elements", true, "array"]], [215, ["swap_elements", true, "dimension_index"]], [216, ["swap_elements", true, "index_1"]], [217, ["swap_elements", true, "index_2"]], [218, ["swap_elements", false, "swapped_array"]], [219, ["split", true, "array"]], [220, ["split", true, "dimension_index"]], [221, ["split", true, "element_index"]], [222, ["split", false, "split_array_left"]], [223, ["split", false, "split_array_right"]], [224, ["reduce_one_dimension_with_element_wise_selected_indices", true, "array"]], [225, ["reduce_one_dimension_with_element_wise_selected_indices", true, "dimension_index"]], [226, ["reduce_one_dimension_with_element_wise_selected_indices", true, "selected_indices"]], [227, ["reduce_one_dimension_with_element_wise_selected_indices", false, "elements"]], [228, ["expand_one_dimension", true, "input"]], [229, ["expand_one_dimension", true, "dimension_index"]], [230, ["expand_one_dimension", false, "output"]], [231, ["reduce_one_dimension", true, "input"]], [232, ["reduce_one_dimension", true, "dimension_index"]], [233, ["reduce_one_dimension", true, "selected_index"]], [234, ["reduce_one_dimension", false, "output"]], [235, ["broadcast_to_shape", true, "target"]], [236, ["broadcast_to_shape", true, "shape"]], [237, ["broadcast_to_shape", false, "result"]], [238, ["differentiate", true, "wrt_input"]], [239, ["differentiate", true, "function_output"]], [240, ["differentiate", true, "order"]], [241, ["differentiate", false, "derivative"]], [242, ["DataType.INTEGER", false, "0"]], [243, ["DataType.INTEGER", false, "1"]], [244, ["DataType.INTEGER", false, "2"]], [245, ["DataType.TEXT", false, "0"]], [246, ["DataType.TEXT", false, "1"]], [247, ["DataType.TEXT", false, "2"]], [248, ["DataType.DECIMAL", false, "0"]], [249, ["DataType.DECIMAL", false, "1"]], [250, ["DataType.DECIMAL", false, "2"]], [251, ["DataType.BOOLEAN", false, "0"]], [252, ["DataType.BOOLEAN", false, "1"]], [253, ["DataType.BOOLEAN", false, "2"]], [-10, ["composite", false, "composite"]], [-50, ["composite", true, "composite"]], [-1000, ["conditional", false, "conditional"]], [-5000, ["conditional", true, "conditional"]], [-100, ["sub_graph", false, "sub_graph"]], [-500, ["sub_graph", true, "sub_graph"]]]